In [10]:
import mysql.connector

# Create a connection object
my_conn = mysql.connector.connect(host="localhost", user="root", password="Mysql@2024", database="mysqltut")

# Create a cursor object
cursor = my_conn.cursor()

# Execute a query
cursor.execute("SELECT * FROM mysqltut.students")
# Extract result
myresult = cursor.fetchall()

cursor = my_conn.cursor()
print("Your are connected to the database successful")
print(myresult)
# Close the cursor and connection objects
cursor.close()
# my_conn.close()

Your are connected to the database successful
[(1, 'bindu', 'patil', 1, 'female', 29324894), (2, 'vaish', 'devi', 2, 'F', 25433453), (3, 'Rakesh', 'Patil', 4, 'M', 22432454), (4, 'papampathi', 'Patil', 5, 'M', 42343545)]

True

In [11]:
import pandas as pd

In [12]:
pd.DataFrame(myresult)

   0           1      2  3       4         5
0  1       bindu  patil  1  female  29324894
1  2       vaish   devi  2       F  25433453
2  3      Rakesh  Patil  4       M  22432454
3  4  papampathi  Patil  5       M  42343545

In [13]:

df = pd.read_sql("SELECT * FROM mysqltut.students",con= my_conn)
my_conn.close()

C:\Users\vaish\AppData\Local\Temp\ipykernel_1876\2060342594.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM mysqltut.students",con= my_conn)

In [17]:
df.to_dict("records")

[{'SL.NO': 1,
  'FIRSTNAME': 'bindu',
  'LASTNAME': 'patil',
  'ROLLNO': 1,
  'GENDER': 'female',
  'PHONENO': 29324894},
 {'SL.NO': 2,
  'FIRSTNAME': 'vaish',
  'LASTNAME': 'devi',
  'ROLLNO': 2,
  'GENDER': 'F',
  'PHONENO': 25433453},
 {'SL.NO': 3,
  'FIRSTNAME': 'Rakesh',
  'LASTNAME': 'Patil',
  'ROLLNO': 4,
  'GENDER': 'M',
  'PHONENO': 22432454},
 {'SL.NO': 4,
  'FIRSTNAME': 'papampathi',
  'LASTNAME': 'Patil',
  'ROLLNO': 5,
  'GENDER': 'M',
  'PHONENO': 42343545}]